app/models/organisation.rb

SELECT 1 AS one FROM "organisations" WHERE "organisations"."slug" = 'test-organisation' LIMIT 1
---
  def generate_slug
    return if name.blank?

    base_slug = name.parameterize
    self.slug = base_slug

    if Organisation.exists?(slug: slug)